In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("Summer.csv")

Summer Olympics Data Analysis Assignment

1. In how many cities Summer Olympics is held so far?

In [ ]:
print(df['City'].unique())
print("Total number of cities where Summer Olympics where held are", len(df['City'].unique()))

['Athens' 'Paris' 'St Louis' 'London' 'Stockholm' 'Antwerp' 'Amsterdam'
 'Los Angeles' 'Berlin' 'Helsinki' 'Melbourne / Stockholm' 'Rome' 'Tokyo'
 'Mexico' 'Munich' 'Montreal' 'Moscow' 'Seoul' 'Barcelona' 'Atlanta'
 'Sydney' 'Beijing']
Total number of cities where Summer Olympics where held are 22


2. Which sport is having most number of Gold Medals so far? (Top 5)

In [ ]:

df2 = df[df['Medal'] == 'Gold']

data = []

for Sport in df2['Sport'].unique():
  data.append([Sport, len(df2[df2['Sport'] == Sport])])

data = pd.DataFrame(data, columns = ['Sport','Gold Medals'])
data = data.sort_values(by = 'Gold Medals', ascending = False)
data.head()

         Sport  Gold Medals
0     Aquatics         1421
1    Athletics         1215
17      Rowing          890
4   Gymnastics          820
3      Fencing          552

3. Which sport is having most number of medals so far? (Top 5)

In [ ]:
data = []

for Sport in df['Sport'].unique():
  data.append([Sport, len(df[df['Sport'] == Sport])])

data = pd.DataFrame(data, columns = ['Sport','Medals'])
data = data.sort_values(by = 'Medals', ascending = False)
data.head()

         Sport  Medals
0     Aquatics    4170
1    Athletics    3638
17      Rowing    2667
4   Gymnastics    2307
3      Fencing    1613

4. Which player has won most number of medals? (Top 5)

In [ ]:
data = []

for Athlete in df['Athlete'].unique():
  data.append([Athlete, len(df[df['Athlete'] == Athlete])])

data = pd.DataFrame(data, columns = ['Athlete','Medals'])
data = data.sort_values(by = 'Medals', ascending = False)
data.head()

                    Athlete  Medals
18640       PHELPS, Michael      22
7197       LATYNINA, Larisa      18
9948     ANDRIANOV, Nikolay      15
6591           ONO, Takashi      13
5103   MANGIAROTTI, Edoardo      13

5. Which player has won most number Gold Medals of medals? (Top 5)

In [ ]:
data = []

for Athlete in df2['Athlete'].unique():
  data.append([Athlete, len(df2[df2['Athlete'] == Athlete])])

data = pd.DataFrame(data, columns = ['Athlete','Gold Medals'])
data = data.sort_values(by = 'Gold Medals', ascending = False)
data.head()

               Athlete  Gold Medals
6851   PHELPS, Michael           18
3320       SPITZ, Mark            9
2714  LATYNINA, Larisa            9
4630       LEWIS, Carl            9
907       NURMI, Paavo            9

6. In which year India won first Gold Medal in Summer Olympics?

In [ ]:
df3 = df2[df2.Country == 'IND']

data = []

for Year in df3['Year'].unique():
  data.append([Year, len(df3[df3['Year'] == Year])])

data = pd.DataFrame(data, columns = ['Year','Gold Medals'])
print("India won it's first gold medal in\n")
data.head(1)

India won it's gold medal in

   Year  Gold Medals
0  1928           15


7. Which event is most popular in terms on number of players? (Top 5)

In [ ]:
data = []

for Event in df['Event'].unique():
  data.append([Event, len(df[df['Event'] == Event])])

data = pd.DataFrame(data, columns = ['Event','Athlete'])
data = data.sort_values(by = 'Athlete', ascending = False)
data.head()

                Event  Athlete
80           Football     1497
176            Hockey     1422
138  Team Competition     1147
327        Basketball     1012
337          Handball      973


8. Which sport is having most female Gold Medalists? (Top 5)

In [ ]:
df4 = df2[df2.Gender != 'Men']

data = []

for Sport in df4['Sport'].unique():
  data.append([Sport, len(df4[df4['Sport'] == Sport])])

data = pd.DataFrame(data, columns = ['Athlete','Female Gold Medalists'])
data = data.sort_values(by = 'Female Gold Medalists', ascending = False)
data.head()

       Athlete  Female Gold Medalists
4     Aquatics                    589
7    Athletics                    389
8   Gymnastics                    268
14      Rowing                    217
11  Volleyball                    166